#include "Dri_Uart.h"

void Dri_Uart_Init(void)
{
    //设置工作模式：8个数据位，1个停止位，无校验位，异步收发
    SM0 = 0;
    SM1 = 1;
//----------------------------------------------------------
    //设置波特率：9600
    PCON &=0x7F;   //SMOD=0
    //定时器1工作在8位自动重装模式
    TMOD &=0x0F;
    TMOD |=0x20;

    //设置定时器1的初值
    TH1 = 0xFD;   //253
    TL1 = 0xFD;

    //启动定时器1
    TR1 = 1;
//----------------------------------------------------------

    //串口接收相关配置
    REN = 1;
    //SM2控制位设置为0，表示接受数据时不校验数据帧的停止位。
    SM2 = 0;
//----------------------------------------------------------

    //使能总开关
    EA = 1;
    //开启UART串口中断
    ES = 1;
    //复位中断标志位
    RI = 0;
    TI = 0;


}

/**
 * @brief UART串口中断处理函数
 * 
 */
void Dri_UART_Handler() interrupt 4
{
    /* 检查接收中断标志位RI，如果为1，表示有一帧数据接收完成 */
    if (RI == 1) {
    }

    /* 检查发送中断标志位TI，如果为1，表示有一帧数据发送完成 */
    if (TI == 1) {
    }
}
